// Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

//__________________________________________________________________________________

// Console.Write("введите 1-е число:");
// int num1=Convert.ToInt32(Console.ReadLine());
// Console.Write("введите 2-е число:");
// int num2=Convert.ToInt32(Console.ReadLine());
// int count=1;
// int result=num1;
// while (count<num2)
// {
//     result=result*num1;
//     count=count+1;
// }
// Console.Write(result);

//____________________________________________________________________________________

// Напишите программу, которая принимает на вход 
// число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12


// Console.Write("введите число:");
// int num=Convert.ToInt32(Console.ReadLine());
// int sum=0;
// while (num>0)
// {
//     int result=num%10;
//     num=num/10;
//     sum=sum+result;
// }



// Console.Write("сумма всех цифр в числе равна: " + sum);

//_________________________________________________________________________________

// Напишите программу, которая задаёт массив 
// из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]






